app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if Artist.where(id: params[:artist_id]).exists?
        @artist = Artist.find(params[:artist_id])
        @songs = @artist.songs
      else
        redirect_to artists_path, alert: "Artist not found!"
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      if Artist.where(id: params[:artist_id]).exists?
        @artist = Artist.find(params[:artist_id])
        if @artist.songs.where(id: params[:id]).exists?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]